<?php

declare(strict_types=1);

namespace Imperia\Modules\Integration1C\Contracts;

/**
 * ==========================================================================
 * VALUE OBJECT INTERFACE
 * ==========================================================================
 *
 * Назначение
 * --------------------------------------------------------------------------
 * Маркерный интерфейс всех Value Object модуля Integration1C.
 *
 * --------------------------------------------------------------------------
 * Что считается Value Object
 * --------------------------------------------------------------------------
 * Value Object представляет неизменяемый объект,
 * описывающий некоторое значение предметной области.
 *
 * Примеры:
 *
 * - ProductUuid
 * - Sku
 * - Price
 * - ImageSource
 *
 * --------------------------------------------------------------------------
 * Ответственность интерфейса
 * --------------------------------------------------------------------------
 * Интерфейс не определяет обязательных методов.
 *
 * Его задача — обозначить принадлежность класса
 * к слою ValueObjects архитектуры Integration1C.
 *
 * --------------------------------------------------------------------------
 * Почему интерфейс пустой
 * --------------------------------------------------------------------------
 * Не все Value Object имеют одинаковое поведение.
 *
 * Поэтому данный интерфейс используется
 * исключительно как маркер.
 */
interface ValueObjectInterface {}
