<?php

namespace Imperia\Core;

/**
 * ==========================================================
 * SYSTEM CONSTANTS
 * ==========================================================
 *
 * Централизованное хранилище системных данных ядра.
 *
 * Используется для:
 *
 * - путей внутри плагина;
 * - версии системы;
 * - общих настроек инфраструктуры.
 *
 * Важно:
 *
 * Этот класс НЕ хранит:
 *
 * - WordPress hooks;
 * - настройки модулей;
 * - бизнес-логику.
 *
 * Он является только источником
 * системных параметров.
 *
 * ==========================================================
 */
final class Constants
{


	/**
	 * ======================================================
	 * PLUGIN VERSION
	 * ======================================================
	 *
	 * Версия плагина.
	 *
	 * Должна совпадать:
	 *
	 * Plugin Header:
	 *
	 * Version: 0.1.0
	 *
	 * и этой константой.
	 *
	 * Используется для:
	 *
	 * - версии CSS;
	 * - версии JavaScript;
	 * - контроля обновлений ресурсов.
	 */
	public const VERSION = '0.1.0';



	/**
	 * ======================================================
	 * PLUGIN PATH
	 * ======================================================
	 *
	 * Абсолютный путь к корню плагина.
	 *
	 * __DIR__ находится здесь:
	 *
	 * /imperia-core/inc/Core/
	 *
	 *
	 * Поднимаемся:
	 *
	 * ../../
	 *
	 * Получаем:
	 *
	 * /imperia-core/
	 *
	 *
	 * Пример результата:
	 *
	 * /var/www/html/wp-content/plugins/imperia-core/
	 *
	 * Используется для:
	 *
	 * - поиска файлов;
	 * - подключения ресурсов;
	 * - работы внутренних сервисов.
	 */
	public const PLUGIN_PATH =
	__DIR__ . '/../../';



	/**
	 * ======================================================
	 * MODULES PATH
	 * ======================================================
	 *
	 * Абсолютный путь к каталогу модулей.
	 *
	 * Итоговый путь:
	 *
	 * /imperia-core/modules/
	 *
	 *
	 * Используется когда ядру необходимо:
	 *
	 * - найти модуль;
	 * - проверить наличие файлов;
	 * - выполнять операции с модулями.
	 *
	 * Например:
	 *
	 * Catalog
	 * Checkout
	 * Search
	 * Account
	 */
	public const MODULES_PATH =
	self::PLUGIN_PATH . 'modules/';



	/**
	 * ======================================================
	 * CONSTRUCTOR
	 * ======================================================
	 *
	 * Запрещаем создавать экземпляры класса.
	 *
	 * Использование:
	 *
	 * Constants::VERSION
	 *
	 * вместо:
	 *
	 * new Constants()
	 */
	private function __construct() {}
}
