<?php


/**
 * ==========================================================
 * CONTACT PLACEMENTS CONFIGURATION
 * ==========================================================
 *
 * Конфигурация мест вывода контактов.
 *
 *
 * Источник данных:
 *
 * ContactPlacementRegistry
 *
 *
 * Добавление нового места вывода
 * не требует изменения ядра.
 *
 *
 * ==========================================================
 */


return [


	/**
	 * Плавающие кнопки.
	 */
	'floating',



	/**
	 * Футер сайта.
	 */
	'footer',



	/**
	 * Шапка сайта.
	 */
	'header',



];
