<?php


/**
 * ==========================================================
 * CONTACT COLLECTIONS CONFIGURATION
 * ==========================================================
 *
 * Конфигурация коллекций контактов.
 *
 *
 * Этот файл является источником данных
 * для ContactCollectionManager.
 *
 *
 * Коллекция НЕ является типом контакта.
 *
 *
 * Например:
 *
 * Коллекция:
 *
 * socials
 *
 *
 * Может содержать:
 *
 * telegram
 * max
 * vk
 *
 *
 * ==========================================================
 */


return [


	/**
	 * Телефоны.
	 */
	'phones',



	/**
	 * Электронная почта.
	 */
	'emails',



	/**
	 * Социальные сети
	 * и мессенджеры.
	 */
	'socials',



	/**
	 * Адреса.
	 */
	'addresses',


];
