<?php


/**
 * ==========================================================
 * CONTACT TYPES CONFIGURATION
 * ==========================================================
 *
 * Конфигурация типов контактов.
 *
 *
 * Этот файл является источником данных
 * для ContactTypeRegistry.
 *
 *
 * Добавление нового типа контакта
 * не требует изменения ядра.
 *
 *
 * Например:
 *
 * Добавить:
 *
 * whatsapp
 *
 * достаточно добавить:
 *
 * 'whatsapp'
 *
 *
 * ==========================================================
 */


return [


	/**
	 * Телефон.
	 */
	'phone',



	/**
	 * Электронная почта.
	 */
	'email',



	/**
	 * Telegram.
	 */
	'telegram',



	/**
	 * MAX Messenger.
	 */
	'max',



	/**
	 * VK.
	 */
	'vk',



];
