<?php

namespace Imperia\Modules\Catalog\Hooks;

use Imperia\Modules\Catalog\Views\MenuRenderer;


/**
 * ==========================================================
 * HEADER BUTTON
 * ==========================================================
 *
 * Точка интеграции каталога
 * с областью шапки сайта.
 *
 * Сейчас используется:
 *
 * wp_footer
 *
 * только как временная точка тестирования.
 *
 * В будущем будет заменён
 * на hook темы Blocksy.
 *
 *
 * Важно:
 *
 * Меняться будет только этот класс.
 *
 * Остальная цепочка останется:
 *
 * HeaderButton
 *        ↓
 * MenuRenderer
 *        ↓
 * CategoryCache
 *        ↓
 * CategoryTree
 *
 * ==========================================================
 */
final class HeaderButton
{


	/**
	 * ======================================================
	 * REGISTER
	 * ======================================================
	 *
	 * Регистрация WordPress hook.
	 *
	 * Сейчас:
	 *
	 * wp_footer
	 *
	 * Позже:
	 *
	 * hook Blocksy Header
	 *
	 * ======================================================
	 */
	public function register(): void
	{
		/**
		 * Blocksy имеет свои точки вывода
		 * 
		 * Привязываемся к hook: blocksy:header:after для вывода каталога
		 */
		add_action(
			'blocksy:header:after',
			[
				$this,
				'render'
			],
			20
		);
	}



	/**
	 * ======================================================
	 * RENDER
	 * ======================================================
	 *
	 * Вывод каталога.
	 */
	public function render(): void
	{


		/**
		 * Дополнительная защита.
		 *
		 * Каталог нужен только
		 * на публичной части сайта.
		 *
		 * Не выводим:
		 *
		 * - админку;
		 * - AJAX;
		 * - REST.
		 */
		if (
			is_admin()
		) {

			return;
		}



		/**
		 * Передаём управление
		 * компоненту представления.
		 */
		(new MenuRenderer())
			->render();
	}
}
